In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats

In [2]:
df = pd.read_csv("AWCustomers.csv")

In [3]:
df.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [15]:
df['BirthDate'] = pd.to_datetime(df['BirthDate'], errors='coerce')
ref_date = pd.to_datetime("2017-03-06")  # based on LastUpdated column
df['Age'] = (ref_date - df['BirthDate']).dt.days // 36

In [21]:
selected_columns = [
    'Age', 'Gender', 'MaritalStatus', 'Occupation',
    'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome',
    'TotalChildren', 'YearlyIncome'
]
df = df[selected_columns]

In [22]:
df.head()

,Age,Gender,MaritalStatus,Occupation,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
0,297,M,M,Clerical,1,3,0,1,81916
1,452,M,M,Clerical,1,2,1,2,81076
2,317,F,S,Clerical,0,3,0,0,86387
3,399,M,M,Skilled Manual,1,2,1,2,61481
4,426,M,S,Skilled Manual,1,1,0,0,51804

In [4]:
dict = {
    'Nominal':['Occupation', 'Gender', 'MaritalStatus', 'Age', 'HomeOwnerFlag'],
    'Discrete':['NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren'],
    'Continuous':['YearlyIncome']
}
print(dict)

{'Nominal': ['Occupation', 'Gender', 'MaritalStatus', 'Age', 'HomeOwnerFlag'], 'Discrete': ['NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren'], 'Continuous': ['YearlyIncome']}

In [5]:
sales = pd.read_csv("AWSales.csv")

In [6]:
sales_df = pd.DataFrame(sales)

In [7]:
sales_df.head()

   CustomerID  BikeBuyer  AvgMonthSpend
0       21173          1          50.97
1       13249          1          53.11
2       29350          1          54.08
3       13503          1          56.93
4       22803          1          55.41